'''
5. Пользователь вводит номер буквы в алфавите. Определить, какая это буква.
'''
a = int(input('Введите номер буквы латинского алфавита: '))
print(f'Буква {chr(a + 96)} находится на {a} месте алфавита.')